表格型数据结构

In [1]:
import pandas as pd
import numpy as np

用字典创建

In [5]:
pd.DataFrame({'one':[1,2,3],'two':[4,5,6]})#指定列的名称，行名自动生成

   one  two
0    1    4
1    2    5
2    3    6

In [6]:
pd.DataFrame({'one':[1,2,3],'two':[4,5,6]},index=['a','b','c'])#指定了行的名称

   one  two
a    1    4
b    2    5
c    3    6

In [4]:
pd.DataFrame({'one':pd.Series(np.arange(3,7)),'two':pd.Series(np.arange(4,8))})

   one  two
0    3    4
1    4    5
2    5    6
3    6    7

In [7]:
df1=pd.DataFrame({'one':pd.Series(np.arange(3,7),index=['a','b','c','d']),'two':pd.Series(np.arange(4,8),index=['a','b','c','d'])})

In [8]:
df1

   one  two
a    3    4
b    4    5
c    5    6
d    6    7

In [9]:
df=pd.DataFrame({'one':pd.Series(np.arange(3,7),index=['a','b','c','d']),'two':pd.Series(np.arange(4,8),index=['a','b','c','d'])})

In [8]:
df.to_csv('test.csv')#保存到csv

In [9]:
a=pd.read_csv('test.csv')#读取csv

In [10]:
a['one']

0    3
1    4
2    5
3    6
Name: one, dtype: int64

In [11]:
a

  Unnamed: 0  one  two
0          a    3    4
1          b    4    5
2          c    5    6
3          d    6    7

In [12]:
a.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
a.values

array([['a', 3, 4],
       ['b', 4, 5],
       ['c', 5, 6],
       ['d', 6, 7]], dtype=object)

In [14]:
df1

   one  two
a    3    4
b    4    5
c    5    6
d    6    7

In [15]:
df1.index #返回了行索引

Index(['a', 'b', 'c', 'd'], dtype='object')

In [16]:
df1.values#返回了值

array([[3, 4],
       [4, 5],
       [5, 6],
       [6, 7]])

In [17]:
df1.columns#返回列索引

Index(['one', 'two'], dtype='object')

In [18]:
df1.T#转置

     a  b  c  d
one  3  4  5  6
two  4  5  6  7

In [19]:
pd.DataFrame({{'one':[1,2,3],'two':[4,7,8]},index=['a','b','c']})

   one  two
a    1    4
b    2    7
c    3    8

In [20]:
pd.DataFrame({'one':pd.Series(np.arange(1,4),index=['a','b','c']),'two':pd.Series([4,7,8],index=['a','b','c'])})

   one  two
a    1    4
b    2    7
c    3    8

In [11]:
pd.Series([1,2],index=['a','t'])

a    1
t    2
dtype: int64

In [21]:
pd.Series([1,2],index=['a','b'])

a    1
b    2
dtype: int64

In [22]:
pd.Series({'one':1,'two':2})

one    1
two    2
dtype: int64

In [23]:
df1.describe()#返回两列的一些统计值

            one       two
count  4.000000  4.000000
mean   4.500000  5.500000
std    1.290994  1.290994
min    3.000000  4.000000
25%    3.750000  4.750000
50%    4.500000  5.500000
75%    5.250000  6.250000
max    6.000000  7.000000

Dataframe属性
index行索引
columns列索引
values值（二维数组
T转置

索引

In [24]:
df1

   one  two
a    3    4
b    4    5
c    5    6
d    6    7

In [25]:
df1['one']['a']#先取列指标再取行指标

3

In [47]:
df1[['one','two']]#对列的花式索引

   one  two
a    3    4
b    4    5
c    5    6
d    6    7

In [26]:
df1.loc['a','two']#用loc,","隔开左边是行右边是列

4

In [27]:
df1.iloc[0,1]

4

In [28]:
df1.iloc[0,:]#dataframe的本质是几列拼在一起，要访问某一行可以用切片

one    3
two    4
Name: a, dtype: int64

In [29]:
df1.loc['a',:]

one    3
two    4
Name: a, dtype: int64

In [30]:
df1.loc[['a','c'],:]#行是花式索引，右边是切片

   one  two
a    3    4
c    5    6

In [46]:
df1.loc[['a','c']]

   one  two
a    3    4
c    5    6

In [31]:
df1.loc["a":"c",'two']#切片和普通索引

a    4
b    5
c    6
Name: two, dtype: int64

数据对齐

In [32]:
df1

   one  two
a    3    4
b    4    5
c    5    6
d    6    7

In [33]:
df2=pd.DataFrame({'two':[1,2,3,4],'one':[1,1,4,8]},index=['c','d','b','a'])
df2
#行列索引对其

   two  one
c    1    1
d    2    1
b    3    4
a    4    8

In [34]:
df1+df2

   one  two
a   11    8
b    8    8
c    6    7
d    7    9

数据缺失

In [35]:
df1

   one  two
a    3    4
b    4    5
c    5    6
d    6    7

In [36]:
df3=pd.DataFrame({'one':[1,2,3],'two':[3,6,7]},index=['a','b','c'])
df3

   one  two
a    1    3
b    2    6
c    3    7

In [37]:
df4=df1+df3
df4

   one   two
a  4.0   7.0
b  6.0  11.0
c  8.0  13.0
d  NaN   NaN

In [38]:
df4.fillna(0)#用0补充缺失值

   one   two
a  4.0   7.0
b  6.0  11.0
c  8.0  13.0
d  0.0   0.0

In [39]:
df4.dropna()

   one   two
a  4.0   7.0
b  6.0  11.0
c  8.0  13.0

In [40]:
df1

   one  two
a    3    4
b    4    5
c    5    6
d    6    7

In [41]:
df3

   one  two
a    1    3
b    2    6
c    3    7

In [42]:
df5=df4
df5.loc['a','one']=np.nan
df5

   one   two
a  NaN   7.0
b  6.0  11.0
c  8.0  13.0
d  NaN   NaN

In [43]:
df5.dropna()#会删除所有包含nan的行，默认参数为any

   one   two
b  6.0  11.0
c  8.0  13.0

In [44]:
df5.dropna(how='all')#只删除所有值都为nan的行

   one   two
a  NaN   7.0
b  6.0  11.0
c  8.0  13.0

In [45]:
df5.dropna(axis=1)#按列为单位，删除所有含nan的列

Empty DataFrame
Columns: []
Index: [a, b, c, d]